export interface EducationData {
  course: string;
  groupsCourse: FacultyInfo[];
}

export interface FacultyInfo {
  faculty: string;
  faculties: levelInfo[];
}
export interface levelInfo {
  level: string;
  sec: string[];
}

export const educationData: EducationData[] = [
  {
    course: "ปวช.",
    groupsCourse: [
      {
        faculty: "การบัญชี",
        faculties: [
          {
            level: "ปวช.1",
            sec: [
              "ปวช1.1",
              "ปวช1.2",
              "ปวช1.3",
              "ปวช1.4",
              "ปวช1.5",
              "ปวช1.6",
              "ปวช1.7",
              "ปวช1.8",
            ],
          },
          {
            level: "ปวช.2",
            sec: ["ปวช.2.1", "ปวช.2.2", "ปวช.2.3", "ปวช.2.4"],
          },
        ],
      },
      {
        faculty: "การตลาด",
        faculties: [
          {
            level: "ปวช.1",
            sec: [
              "ปวช1.1",
              "ปวช1.2",
              "ปวช1.3",
              "ปวช1.4",
              "ปวช1.5",
              "ปวช1.6",
              "ปวช1.7",
              "ปวช1.8",
            ],
          },
          {
            level: "ปวช.2",
            sec: ["ปวช.2.1", "ปวช.2.2", "ปวช.2.3", "ปวช.2.4"],
          },
        ],
      },
      {
        faculty: "เทคโนโลยีธุรกิจดิจิทัล",
        faculties: [
          {
            level: "ปวช.1",
            sec: [
              "ปวช1.1",
              "ปวช1.2",
              "ปวช1.3",
              "ปวช1.4",
              "ปวช1.5",
              "ปวช1.6",
              "ปวช1.7",
              "ปวช1.8",
            ],
          },
          {
            level: "ปวช.2",
            sec: ["ปวช.2.1", "ปวช.2.2", "ปวช.2.3", "ปวช.2.4"],
          },
        ],
      },
    ],
  },
  {
    course: "ปวส.",
    groupsCourse: [
      {
        faculty: "การบิน",
        faculties: [
          {
            level: "ปวส.1",
            sec: [
              "ปวส.1.1",
              "ปวส.1.2",
              "ปวส.1.3",
              "ปวส.1.4",
              "ปวส.1.5",
              "ปวส.1.6",
              "ปวส.1.7",
              "ปวส.1.8",
            ],
          },
          {
            level: "ปวส.2",
            sec: ["ปวส.2.1", "ปวส.2.2", "ปวส.2.3", "ปวส.2.4"],
          },
        ],
      },
      {
        faculty: "การกิน",
        faculties: [
          {
            level: "ปวส.1",
            sec: [
              "ปวส.1.1",
              "ปวส.1.2",
              "ปวส.1.3",
              "ปวส.1.4",
              "ปวส.1.5",
              "ปวส.1.6",
              "ปวส.1.7",
              "ปวส.1.8",
            ],
          },
          {
            level: "ปวส.2",
            sec: ["ปวส.2.1", "ปวส.2.2", "ปวส.2.3", "ปวส.2.4"],
          },
        ],
      },
      {
        faculty: "การไฟฟ้า",
        faculties: [
          {
            level: "ปวส.1",
            sec: [
              "ปวส.1.1",
              "ปวส.1.2",
              "ปวส.1.3",
              "ปวส.1.4",
              "ปวส.1.5",
              "ปวส.1.6",
              "ปวส.1.7",
              "ปวส.1.8",
            ],
          },
          {
            level: "ปวส.2",
            sec: ["ปวส.2.1", "ปวส.2.2", "ปวส.2.3", "ปวส.2.4"],
          },
        ],
      },
    ],
  },
];
